/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.Write ("Inrut a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Inrut a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
if (num1 <= num2)
{
    Console.WriteLine("Max = " + num2);
}
else
{
    Console.WriteLine("Max = " + num1);
}
*/
